---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOption
source: html/b704c9ca-baf3-f1f1-7d2a-597a4015ff13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOption Property

Some types of elements can't belong to an Option. Elements of these types were not added to this Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId NeverInOption { get; }
```